{
  "transform_params" : {
    "data" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 1,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "name" : "data_bn",
      "bottom" : "data",
      "weights" : {

      },
      "debug_info" : "data_bn",
      "top" : "data_bn",
      "C" : 3,
      "blob_batchnorm_params" : 1,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv0",
      "blob_weights" : 5,
      "K" : 3,
      "blob_biases" : 3,
      "stride_x" : 2,
      "name" : "conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "data_bn",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "pool0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 3,
      "top" : "pool0",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "pool0",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "conv0",
      "weights" : {

      },
      "pad_mode" : 1,
      "size_y" : 3,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block0_0\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block0_0\/conv0",
      "blob_weights" : 9,
      "K" : 24,
      "blob_biases" : 7,
      "name" : "block0_0\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "pool0",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block0_0\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block0_0\/conv1",
      "blob_weights" : 13,
      "K" : 58,
      "blob_biases" : 11,
      "stride_x" : 2,
      "name" : "block0_0\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 58,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_0\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block0_0\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block0_0\/conv2",
      "blob_weights" : 17,
      "K" : 58,
      "blob_biases" : 15,
      "name" : "block0_0\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_0\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block0_0\/conv3",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block0_0\/conv3",
      "blob_weights" : 21,
      "K" : 24,
      "blob_biases" : 19,
      "stride_x" : 2,
      "name" : "block0_0\/conv3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 24,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "pool0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block0_0\/conv4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block0_0\/conv4",
      "blob_weights" : 25,
      "K" : 24,
      "blob_biases" : 23,
      "name" : "block0_0\/conv4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_0\/conv3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block0_0\/concat",
      "top" : "block0_0\/concat",
      "type" : "concat",
      "name" : "block0_0\/concat",
      "bottom" : "block0_0\/conv4,block0_0\/conv2"
    },
    {
      "name" : "block0_0\/reshape0",
      "weights" : {

      },
      "dst_w" : 784,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 58,
      "mode" : 0,
      "bottom" : "block0_0\/concat",
      "debug_info" : "block0_0\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block0_0\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block0_0\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block0_0\/transpose",
      "top" : "block0_0\/transpose",
      "type" : "transpose",
      "name" : "block0_0\/transpose"
    },
    {
      "name" : "block0_0\/reshape1",
      "weights" : {

      },
      "dst_w" : 28,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 28,
      "mode" : 0,
      "bottom" : "block0_0\/transpose",
      "debug_info" : "block0_0\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 116,
      "top" : "block0_0"
    },
    {
      "bottom" : "block0_0",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block0_1\/slice",
      "n_outputs" : 2,
      "top" : "block0_1\/branch0,block0_1\/branch1",
      "type" : "split",
      "name" : "block0_1\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block0_1\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block0_1\/conv0",
      "blob_weights" : 29,
      "K" : 58,
      "blob_biases" : 27,
      "name" : "block0_1\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_1\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block0_1\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block0_1\/conv1",
      "blob_weights" : 33,
      "K" : 58,
      "blob_biases" : 31,
      "name" : "block0_1\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 58,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_1\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block0_1\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block0_1\/conv2",
      "blob_weights" : 37,
      "K" : 58,
      "blob_biases" : 35,
      "name" : "block0_1\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_1\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block0_1\/concat",
      "top" : "block0_1\/concat",
      "type" : "concat",
      "name" : "block0_1\/concat",
      "bottom" : "block0_1\/branch0,block0_1\/conv2"
    },
    {
      "name" : "block0_1\/reshape0",
      "weights" : {

      },
      "dst_w" : 784,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 58,
      "mode" : 0,
      "bottom" : "block0_1\/concat",
      "debug_info" : "block0_1\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block0_1\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block0_1\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block0_1\/transpose",
      "top" : "block0_1\/transpose",
      "type" : "transpose",
      "name" : "block0_1\/transpose"
    },
    {
      "name" : "block0_1\/reshape1",
      "weights" : {

      },
      "dst_w" : 28,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 28,
      "mode" : 0,
      "bottom" : "block0_1\/transpose",
      "debug_info" : "block0_1\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 116,
      "top" : "block0_1"
    },
    {
      "bottom" : "block0_1",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block0_2\/slice",
      "n_outputs" : 2,
      "top" : "block0_2\/branch0,block0_2\/branch1",
      "type" : "split",
      "name" : "block0_2\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block0_2\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block0_2\/conv0",
      "blob_weights" : 41,
      "K" : 58,
      "blob_biases" : 39,
      "name" : "block0_2\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_2\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block0_2\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block0_2\/conv1",
      "blob_weights" : 45,
      "K" : 58,
      "blob_biases" : 43,
      "name" : "block0_2\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 58,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_2\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block0_2\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block0_2\/conv2",
      "blob_weights" : 49,
      "K" : 58,
      "blob_biases" : 47,
      "name" : "block0_2\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_2\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block0_2\/concat",
      "top" : "block0_2\/concat",
      "type" : "concat",
      "name" : "block0_2\/concat",
      "bottom" : "block0_2\/branch0,block0_2\/conv2"
    },
    {
      "name" : "block0_2\/reshape0",
      "weights" : {

      },
      "dst_w" : 784,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 58,
      "mode" : 0,
      "bottom" : "block0_2\/concat",
      "debug_info" : "block0_2\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block0_2\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block0_2\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block0_2\/transpose",
      "top" : "block0_2\/transpose",
      "type" : "transpose",
      "name" : "block0_2\/transpose"
    },
    {
      "name" : "block0_2\/reshape1",
      "weights" : {

      },
      "dst_w" : 28,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 28,
      "mode" : 0,
      "bottom" : "block0_2\/transpose",
      "debug_info" : "block0_2\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 116,
      "top" : "block0_2"
    },
    {
      "bottom" : "block0_2",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block0_3\/slice",
      "n_outputs" : 2,
      "top" : "block0_3\/branch0,block0_3\/branch1",
      "type" : "split",
      "name" : "block0_3\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block0_3\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block0_3\/conv0",
      "blob_weights" : 53,
      "K" : 58,
      "blob_biases" : 51,
      "name" : "block0_3\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_3\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block0_3\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block0_3\/conv1",
      "blob_weights" : 57,
      "K" : 58,
      "blob_biases" : 55,
      "name" : "block0_3\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 58,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_3\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block0_3\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block0_3\/conv2",
      "blob_weights" : 61,
      "K" : 58,
      "blob_biases" : 59,
      "name" : "block0_3\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 58,
      "bottom" : "block0_3\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block0_3\/concat",
      "top" : "block0_3\/concat",
      "type" : "concat",
      "name" : "block0_3\/concat",
      "bottom" : "block0_3\/branch0,block0_3\/conv2"
    },
    {
      "name" : "block0_3\/reshape0",
      "weights" : {

      },
      "dst_w" : 784,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 58,
      "mode" : 0,
      "bottom" : "block0_3\/concat",
      "debug_info" : "block0_3\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block0_3\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block0_3\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block0_3\/transpose",
      "top" : "block0_3\/transpose",
      "type" : "transpose",
      "name" : "block0_3\/transpose"
    },
    {
      "name" : "block0_3\/reshape1",
      "weights" : {

      },
      "dst_w" : 28,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 28,
      "mode" : 0,
      "bottom" : "block0_3\/transpose",
      "debug_info" : "block0_3\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 116,
      "top" : "block0_3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_0\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_0\/conv0",
      "blob_weights" : 65,
      "K" : 116,
      "blob_biases" : 63,
      "name" : "block1_0\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block0_3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block1_0\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block1_0\/conv1",
      "blob_weights" : 69,
      "K" : 116,
      "blob_biases" : 67,
      "stride_x" : 2,
      "name" : "block1_0\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 116,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_0\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_0\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_0\/conv2",
      "blob_weights" : 73,
      "K" : 116,
      "blob_biases" : 71,
      "name" : "block1_0\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_0\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block1_0\/conv3",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block1_0\/conv3",
      "blob_weights" : 77,
      "K" : 116,
      "blob_biases" : 75,
      "stride_x" : 2,
      "name" : "block1_0\/conv3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 116,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block0_3",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_0\/conv4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_0\/conv4",
      "blob_weights" : 81,
      "K" : 116,
      "blob_biases" : 79,
      "name" : "block1_0\/conv4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_0\/conv3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block1_0\/concat",
      "top" : "block1_0\/concat",
      "type" : "concat",
      "name" : "block1_0\/concat",
      "bottom" : "block1_0\/conv4,block1_0\/conv2"
    },
    {
      "name" : "block1_0\/reshape0",
      "weights" : {

      },
      "dst_w" : 196,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 116,
      "mode" : 0,
      "bottom" : "block1_0\/concat",
      "debug_info" : "block1_0\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block1_0\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block1_0\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block1_0\/transpose",
      "top" : "block1_0\/transpose",
      "type" : "transpose",
      "name" : "block1_0\/transpose"
    },
    {
      "name" : "block1_0\/reshape1",
      "weights" : {

      },
      "dst_w" : 14,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 14,
      "mode" : 0,
      "bottom" : "block1_0\/transpose",
      "debug_info" : "block1_0\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 232,
      "top" : "block1_0"
    },
    {
      "bottom" : "block1_0",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block1_1\/slice",
      "n_outputs" : 2,
      "top" : "block1_1\/branch0,block1_1\/branch1",
      "type" : "split",
      "name" : "block1_1\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_1\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_1\/conv0",
      "blob_weights" : 85,
      "K" : 116,
      "blob_biases" : 83,
      "name" : "block1_1\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_1\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block1_1\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block1_1\/conv1",
      "blob_weights" : 89,
      "K" : 116,
      "blob_biases" : 87,
      "name" : "block1_1\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 116,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_1\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_1\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_1\/conv2",
      "blob_weights" : 93,
      "K" : 116,
      "blob_biases" : 91,
      "name" : "block1_1\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_1\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block1_1\/concat",
      "top" : "block1_1\/concat",
      "type" : "concat",
      "name" : "block1_1\/concat",
      "bottom" : "block1_1\/branch0,block1_1\/conv2"
    },
    {
      "name" : "block1_1\/reshape0",
      "weights" : {

      },
      "dst_w" : 196,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 116,
      "mode" : 0,
      "bottom" : "block1_1\/concat",
      "debug_info" : "block1_1\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block1_1\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block1_1\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block1_1\/transpose",
      "top" : "block1_1\/transpose",
      "type" : "transpose",
      "name" : "block1_1\/transpose"
    },
    {
      "name" : "block1_1\/reshape1",
      "weights" : {

      },
      "dst_w" : 14,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 14,
      "mode" : 0,
      "bottom" : "block1_1\/transpose",
      "debug_info" : "block1_1\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 232,
      "top" : "block1_1"
    },
    {
      "bottom" : "block1_1",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block1_2\/slice",
      "n_outputs" : 2,
      "top" : "block1_2\/branch0,block1_2\/branch1",
      "type" : "split",
      "name" : "block1_2\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_2\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_2\/conv0",
      "blob_weights" : 97,
      "K" : 116,
      "blob_biases" : 95,
      "name" : "block1_2\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_2\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block1_2\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block1_2\/conv1",
      "blob_weights" : 101,
      "K" : 116,
      "blob_biases" : 99,
      "name" : "block1_2\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 116,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_2\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_2\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_2\/conv2",
      "blob_weights" : 105,
      "K" : 116,
      "blob_biases" : 103,
      "name" : "block1_2\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_2\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block1_2\/concat",
      "top" : "block1_2\/concat",
      "type" : "concat",
      "name" : "block1_2\/concat",
      "bottom" : "block1_2\/branch0,block1_2\/conv2"
    },
    {
      "name" : "block1_2\/reshape0",
      "weights" : {

      },
      "dst_w" : 196,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 116,
      "mode" : 0,
      "bottom" : "block1_2\/concat",
      "debug_info" : "block1_2\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block1_2\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block1_2\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block1_2\/transpose",
      "top" : "block1_2\/transpose",
      "type" : "transpose",
      "name" : "block1_2\/transpose"
    },
    {
      "name" : "block1_2\/reshape1",
      "weights" : {

      },
      "dst_w" : 14,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 14,
      "mode" : 0,
      "bottom" : "block1_2\/transpose",
      "debug_info" : "block1_2\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 232,
      "top" : "block1_2"
    },
    {
      "bottom" : "block1_2",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block1_3\/slice",
      "n_outputs" : 2,
      "top" : "block1_3\/branch0,block1_3\/branch1",
      "type" : "split",
      "name" : "block1_3\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_3\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_3\/conv0",
      "blob_weights" : 109,
      "K" : 116,
      "blob_biases" : 107,
      "name" : "block1_3\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_3\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block1_3\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block1_3\/conv1",
      "blob_weights" : 113,
      "K" : 116,
      "blob_biases" : 111,
      "name" : "block1_3\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 116,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_3\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_3\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_3\/conv2",
      "blob_weights" : 117,
      "K" : 116,
      "blob_biases" : 115,
      "name" : "block1_3\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_3\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block1_3\/concat",
      "top" : "block1_3\/concat",
      "type" : "concat",
      "name" : "block1_3\/concat",
      "bottom" : "block1_3\/branch0,block1_3\/conv2"
    },
    {
      "name" : "block1_3\/reshape0",
      "weights" : {

      },
      "dst_w" : 196,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 116,
      "mode" : 0,
      "bottom" : "block1_3\/concat",
      "debug_info" : "block1_3\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block1_3\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block1_3\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block1_3\/transpose",
      "top" : "block1_3\/transpose",
      "type" : "transpose",
      "name" : "block1_3\/transpose"
    },
    {
      "name" : "block1_3\/reshape1",
      "weights" : {

      },
      "dst_w" : 14,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 14,
      "mode" : 0,
      "bottom" : "block1_3\/transpose",
      "debug_info" : "block1_3\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 232,
      "top" : "block1_3"
    },
    {
      "bottom" : "block1_3",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block1_4\/slice",
      "n_outputs" : 2,
      "top" : "block1_4\/branch0,block1_4\/branch1",
      "type" : "split",
      "name" : "block1_4\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_4\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_4\/conv0",
      "blob_weights" : 121,
      "K" : 116,
      "blob_biases" : 119,
      "name" : "block1_4\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_4\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block1_4\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block1_4\/conv1",
      "blob_weights" : 125,
      "K" : 116,
      "blob_biases" : 123,
      "name" : "block1_4\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 116,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_4\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_4\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_4\/conv2",
      "blob_weights" : 129,
      "K" : 116,
      "blob_biases" : 127,
      "name" : "block1_4\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_4\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block1_4\/concat",
      "top" : "block1_4\/concat",
      "type" : "concat",
      "name" : "block1_4\/concat",
      "bottom" : "block1_4\/branch0,block1_4\/conv2"
    },
    {
      "name" : "block1_4\/reshape0",
      "weights" : {

      },
      "dst_w" : 196,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 116,
      "mode" : 0,
      "bottom" : "block1_4\/concat",
      "debug_info" : "block1_4\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block1_4\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block1_4\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block1_4\/transpose",
      "top" : "block1_4\/transpose",
      "type" : "transpose",
      "name" : "block1_4\/transpose"
    },
    {
      "name" : "block1_4\/reshape1",
      "weights" : {

      },
      "dst_w" : 14,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 14,
      "mode" : 0,
      "bottom" : "block1_4\/transpose",
      "debug_info" : "block1_4\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 232,
      "top" : "block1_4"
    },
    {
      "bottom" : "block1_4",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block1_5\/slice",
      "n_outputs" : 2,
      "top" : "block1_5\/branch0,block1_5\/branch1",
      "type" : "split",
      "name" : "block1_5\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_5\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_5\/conv0",
      "blob_weights" : 133,
      "K" : 116,
      "blob_biases" : 131,
      "name" : "block1_5\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_5\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block1_5\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block1_5\/conv1",
      "blob_weights" : 137,
      "K" : 116,
      "blob_biases" : 135,
      "name" : "block1_5\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 116,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_5\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_5\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_5\/conv2",
      "blob_weights" : 141,
      "K" : 116,
      "blob_biases" : 139,
      "name" : "block1_5\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_5\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block1_5\/concat",
      "top" : "block1_5\/concat",
      "type" : "concat",
      "name" : "block1_5\/concat",
      "bottom" : "block1_5\/branch0,block1_5\/conv2"
    },
    {
      "name" : "block1_5\/reshape0",
      "weights" : {

      },
      "dst_w" : 196,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 116,
      "mode" : 0,
      "bottom" : "block1_5\/concat",
      "debug_info" : "block1_5\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block1_5\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block1_5\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block1_5\/transpose",
      "top" : "block1_5\/transpose",
      "type" : "transpose",
      "name" : "block1_5\/transpose"
    },
    {
      "name" : "block1_5\/reshape1",
      "weights" : {

      },
      "dst_w" : 14,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 14,
      "mode" : 0,
      "bottom" : "block1_5\/transpose",
      "debug_info" : "block1_5\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 232,
      "top" : "block1_5"
    },
    {
      "bottom" : "block1_5",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block1_6\/slice",
      "n_outputs" : 2,
      "top" : "block1_6\/branch0,block1_6\/branch1",
      "type" : "split",
      "name" : "block1_6\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_6\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_6\/conv0",
      "blob_weights" : 145,
      "K" : 116,
      "blob_biases" : 143,
      "name" : "block1_6\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_6\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block1_6\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block1_6\/conv1",
      "blob_weights" : 149,
      "K" : 116,
      "blob_biases" : 147,
      "name" : "block1_6\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 116,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_6\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_6\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_6\/conv2",
      "blob_weights" : 153,
      "K" : 116,
      "blob_biases" : 151,
      "name" : "block1_6\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_6\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block1_6\/concat",
      "top" : "block1_6\/concat",
      "type" : "concat",
      "name" : "block1_6\/concat",
      "bottom" : "block1_6\/branch0,block1_6\/conv2"
    },
    {
      "name" : "block1_6\/reshape0",
      "weights" : {

      },
      "dst_w" : 196,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 116,
      "mode" : 0,
      "bottom" : "block1_6\/concat",
      "debug_info" : "block1_6\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block1_6\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block1_6\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block1_6\/transpose",
      "top" : "block1_6\/transpose",
      "type" : "transpose",
      "name" : "block1_6\/transpose"
    },
    {
      "name" : "block1_6\/reshape1",
      "weights" : {

      },
      "dst_w" : 14,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 14,
      "mode" : 0,
      "bottom" : "block1_6\/transpose",
      "debug_info" : "block1_6\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 232,
      "top" : "block1_6"
    },
    {
      "bottom" : "block1_6",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block1_7\/slice",
      "n_outputs" : 2,
      "top" : "block1_7\/branch0,block1_7\/branch1",
      "type" : "split",
      "name" : "block1_7\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_7\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_7\/conv0",
      "blob_weights" : 157,
      "K" : 116,
      "blob_biases" : 155,
      "name" : "block1_7\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_7\/branch1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block1_7\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block1_7\/conv1",
      "blob_weights" : 161,
      "K" : 116,
      "blob_biases" : 159,
      "name" : "block1_7\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 116,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_7\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block1_7\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block1_7\/conv2",
      "blob_weights" : 165,
      "K" : 116,
      "blob_biases" : 163,
      "name" : "block1_7\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 116,
      "bottom" : "block1_7\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block1_7\/concat",
      "top" : "block1_7\/concat",
      "type" : "concat",
      "name" : "block1_7\/concat",
      "bottom" : "block1_7\/branch0,block1_7\/conv2"
    },
    {
      "name" : "block1_7\/reshape0",
      "weights" : {

      },
      "dst_w" : 196,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 116,
      "mode" : 0,
      "bottom" : "block1_7\/concat",
      "debug_info" : "block1_7\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block1_7\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block1_7\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block1_7\/transpose",
      "top" : "block1_7\/transpose",
      "type" : "transpose",
      "name" : "block1_7\/transpose"
    },
    {
      "name" : "block1_7\/reshape1",
      "weights" : {

      },
      "dst_w" : 14,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 14,
      "mode" : 0,
      "bottom" : "block1_7\/transpose",
      "debug_info" : "block1_7\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 232,
      "top" : "block1_7"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block2_0\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block2_0\/conv0",
      "blob_weights" : 169,
      "K" : 232,
      "blob_biases" : 167,
      "name" : "block2_0\/conv0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 232,
      "bottom" : "block1_7",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block2_0\/conv1",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block2_0\/conv1",
      "blob_weights" : 173,
      "K" : 232,
      "blob_biases" : 171,
      "stride_x" : 2,
      "name" : "block2_0\/conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 232,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 232,
      "bottom" : "block2_0\/conv0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block2_0\/conv2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block2_0\/conv2",
      "blob_weights" : 177,
      "K" : 232,
      "blob_biases" : 175,
      "name" : "block2_0\/conv2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 232,
      "bottom" : "block2_0\/conv1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "block2_0\/conv3",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "block2_0\/conv3",
      "blob_weights" : 181,
      "K" : 232,
      "blob_biases" : 179,
      "stride_x" : 2,
      "name" : "block2_0\/conv3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 232,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 232,
      "bottom" : "block1_7",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block2_0\/conv4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block2_0\/conv4",
      "blob_weights" : 185,
      "K" : 232,
      "blob_biases" : 183,
      "name" : "block2_0\/conv4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 232,
      "bottom" : "block2_0\/conv3",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "block2_0\/concat",
      "top" : "block2_0\/concat",
      "type" : "concat",
      "name" : "block2_0\/concat",
      "bottom" : "block2_0\/conv4,block2_0\/conv2"
    },
    {
      "name" : "block2_0\/reshape0",
      "weights" : {

      },
      "dst_w" : 49,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 232,
      "mode" : 0,
      "bottom" : "block2_0\/concat",
      "debug_info" : "block2_0\/reshape0",
      "dst_seq" : 0,
      "dst_k" : 2,
      "top" : "block2_0\/reshape0"
    },
    {
      "axis_h" : 2,
      "axis_w" : 0,
      "bottom" : "block2_0\/reshape0",
      "axis_k" : 1,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "block2_0\/transpose",
      "top" : "block2_0\/transpose",
      "type" : "transpose",
      "name" : "block2_0\/transpose"
    },
    {
      "name" : "block2_0\/reshape1",
      "weights" : {

      },
      "dst_w" : 7,
      "version" : 1,
      "dst_n" : 0,
      "type" : "reshape",
      "dst_h" : 7,
      "mode" : 0,
      "bottom" : "block2_0\/transpose",
      "debug_info" : "block2_0\/reshape1",
      "dst_seq" : 0,
      "dst_k" : 464,
      "top" : "block2_0"
    },
    {
      "bottom" : "block2_0",
      "cut" : 0,
      "weights" : {

      },
      "debug_info" : "block2_1\/slice",
      "n_outputs" : 2,
      "top" : "block2_1\/branch0,block2_1\/branch1",
      "type" : "split",
      "name" : "block2_1\/slice"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "block2_1\/conv0",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "block2_1\/conv0",
      "blob_weights" : 189,
      "K" : 232,
      "blob_biases" : 187,
      "name" : "block2_1\/conv0",
